# New York Schools
A small project that demonstrates how one can analyze data from multiple sources and bring them all together to drive meaningful insights.

In [7]:
import pandas as pd
# A list of the data files
data_files = [
    "ap_2010.csv",
    "class_size.csv",
    "demographics.csv",
    "graduation.csv",
    "hs_directory.csv",
    "sat_results.csv"
]
   
data = {}
for file in data_files:
    read_file = pd.read_csv('__data__/{0}'.format(file))
    key_name = file.replace(".csv","")
    data[key_name] = read_file

In [8]:
# Reviewing the Data
print(data['sat_results'].head(5))

      DBN                                    SCHOOL NAME  \
0  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES
1  01M448            UNIVERSITY NEIGHBORHOOD HIGH SCHOOL
2  01M450                     EAST SIDE COMMUNITY SCHOOL
3  01M458                      FORSYTH SATELLITE ACADEMY
4  01M509                        MARTA VALLE HIGH SCHOOL

  Num of SAT Test Takers SAT Critical Reading Avg. Score SAT Math Avg. Score  \
0                     29                             355                 404
1                     91                             383                 423
2                     70                             377                 402
3                      7                             414                 401
4                     44                             390                 433

  SAT Writing Avg. Score
0                    363
1                    366
2                    370
3                    359
4                    384

In [14]:
'''Reading in the txt surveys and combining them into a single DataFrame.'''
all_survey = pd.read_csv('__txt_data__/2011_School_Survey/survey_all.txt', delimiter="\t", encoding ='windows-1252')
d75_survey = pd.read_csv('__txt_data__/2011_School_Survey/survey_d75.txt', delimiter="\t", encoding ='windows-1252')

survey = pd.concat([all_survey, d75_survey], axis=0)
survey.head()

,dbn,bn,schoolname,d75,studentssurveyed,highschool,schooltype,rr_s,rr_t,rr_p,...,s_q14_2,s_q14_3,s_q14_4,s_q14_5,s_q14_6,s_q14_7,s_q14_8,s_q14_9,s_q14_10,s_q14_11
0,01M015,M015,P.S. 015 Roberto Clemente,0,No,0.0,Elementary School,NaN,88,60,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,01M019,M019,P.S. 019 Asher Levy,0,No,0.0,Elementary School,NaN,100,60,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,01M020,M020,P.S. 020 Anna Silver,0,No,0.0,Elementary School,NaN,88,73,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,01M034,M034,P.S. 034 Franklin D. Roosevelt,0,Yes,0.0,Elementary / Middle School,89.0,73,50,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,01M063,M063,P.S. 063 William McKinley,0,No,0.0,Elementary School,NaN,100,60,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Combining Files

Here we combine the text files we previously read into the program.

In [15]:
# Renaming columns
survey['DBN'] = survey['dbn']
# Removing all the useless columns. There were over 2000 columns in this file. 
columns_to_keep = ["DBN", "rr_s", "rr_t", "rr_p", "N_s", "N_t", "N_p", "saf_p_11", "com_p_11", "eng_p_11", "aca_p_11", "saf_t_11", "com_t_11", "eng_t_11", "aca_t_11", "saf_s_11", "com_s_11", "eng_s_11", "aca_s_11", "saf_tot_11", "com_tot_11", "eng_tot_11", "aca_tot_11"]
survey = survey.loc[:,columns_to_keep]
data['survey'] = survey 
print(data['survey'])

       DBN  rr_s  rr_t  rr_p    N_s   N_t    N_p  saf_p_11  com_p_11  \
0   01M015   NaN    88    60    NaN  22.0   90.0       8.5       7.6
1   01M019   NaN   100    60    NaN  34.0  161.0       8.4       7.6
2   01M020   NaN    88    73    NaN  42.0  367.0       8.9       8.3
3   01M034  89.0    73    50  145.0  29.0  151.0       8.8       8.2
4   01M063   NaN   100    60    NaN  23.0   90.0       8.7       7.9
..     ...   ...   ...   ...    ...   ...    ...       ...       ...
51  75X352  90.0    58    48   38.0  46.0  160.0       8.9       8.3
52  75X721  84.0    90    48  237.0  82.0  239.0       8.6       7.6
53  75X723  77.0    74    20  103.0  69.0   74.0       8.4       7.8
54  75X754  63.0    93    22  336.0  82.0  124.0       8.3       7.5
55  75X811  38.0    63    19   44.0  71.0  119.0       8.5       7.8

    eng_p_11  ...  eng_t_11  aca_t_11  saf_s_11  com_s_11  eng_s_11  aca_s_11  \
0        7.5  ...       7.6       7.9       NaN       NaN       NaN       NaN
1        7.6  ...       8.9       9.1       NaN       NaN       NaN       NaN
2        8.3  ...       6.8       7.5       NaN       NaN       NaN       NaN
3        8.0  ...       6.8       7.8       6.2       5.9       6.5       7.4
4        8.1  ...       7.8       8.1       NaN       NaN       NaN       NaN
..       ...  ...       ...       ...       ...       ...       ...       ...
51       7.9  ...       5.7       5.8       6.8       6.0       7.8       7.6
52       7.5  ...       6.7       7.0       7.8       7.2       7.8       7.9
53       7.8  ...       6.7       7.6       6.7       7.2       7.7       7.7
54       7.5  ...       6.6       7.1       6.8       6.6       7.6       7.7
55       7.7  ...       6.5       7.0       7.7       6.1       7.7       7.7

    saf_tot_11  com_tot_11  eng_tot_11  aca_tot_11
0          8.0         7.7         7.5         7.9
1          8.5         8.1         8.2         8.4
2          8.2         7.3         7.5         8.0
3          7.3         6.7         7.1         7.9
4          8.5         7.6         7.9         8.0
..         ...         ...         ...         ...
51         7.4         6.6         7.1         7.2
52         8.0         7.1         7.3         7.6
53         7.6         7.4         7.4         7.7
54         7.2         6.9         7.3         7.5
55         7.7         6.8         7.3         7.5

[1702 rows x 23 columns]

In [17]:

def add_zero(num):
    '''This function adds a leading zero to the necessary column.'''
    str_num = str(num)
    len_num = len(str_num)
    if len_num <= 1:
        return str_num.zfill(2)
    else:
        return str_num

# Updating the HS_Directory file and adding a column to the class size DataFrame. 
data['hs_directory']['DBN'] = data['hs_directory']['dbn']
data['class_size']['padded_csd'] = data['class_size']['CSD'].apply(add_zero)
data['class_size']['DBN'] = data['class_size']['padded_csd'] + data['class_size']['SCHOOL CODE']
data['class_size'].head()

,CSD,BOROUGH,SCHOOL CODE,SCHOOL NAME,GRADE,PROGRAM TYPE,CORE SUBJECT (MS CORE and 9-12 ONLY),CORE COURSE (MS CORE and 9-12 ONLY),SERVICE CATEGORY(K-9* ONLY),NUMBER OF STUDENTS / SEATS FILLED,NUMBER OF SECTIONS,AVERAGE CLASS SIZE,SIZE OF SMALLEST CLASS,SIZE OF LARGEST CLASS,DATA SOURCE,SCHOOLWIDE PUPIL-TEACHER RATIO,padded_csd,DBN
0,1,M,M015,P.S. 015 Roberto Clemente,0K,GEN ED,-,-,-,19.0,1.0,19.0,19.0,19.0,ATS,NaN,01,01M015
1,1,M,M015,P.S. 015 Roberto Clemente,0K,CTT,-,-,-,21.0,1.0,21.0,21.0,21.0,ATS,NaN,01,01M015
2,1,M,M015,P.S. 015 Roberto Clemente,01,GEN ED,-,-,-,17.0,1.0,17.0,17.0,17.0,ATS,NaN,01,01M015
3,1,M,M015,P.S. 015 Roberto Clemente,01,CTT,-,-,-,17.0,1.0,17.0,17.0,17.0,ATS,NaN,01,01M015
4,1,M,M015,P.S. 015 Roberto Clemente,02,GEN ED,-,-,-,15.0,1.0,15.0,15.0,15.0,ATS,NaN,01,01M015